### [DataFrame의 인덱스 다루기 -3]
- 행 인덱스를 정수형 인덱스로 초기화
- 기존 행 인덱스 => 컬럼으로 추가 시킴[기본값]
- 메서드 : 변수명.reset_index()

In [1]:
# [1] 모듈 로딩
import pandas as pd

In [2]:
# [2] 데이터 준비
jumsu={'name':['마징가','태권V','원더우먼'],
       'kor':[89,100,99],
       'eng':[70,80,90],
       'math':[99,88,77]}

In [3]:
# [3] Dict => DataFrame 형태로 저장
jumsuDF=pd.DataFrame(jumsu)
jumsuDF

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [9]:
# [4] 행 인덱스 초기화
DF2=jumsuDF.reset_index()
DF2
DF2.drop('index',axis=1)
DF2.drop(columns='index')

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77

In [8]:
# [5] 행 인덱스 초기화 => 기존 행을 컬럼으로 추가하지 않기
DF2=jumsuDF.reset_index(drop=True) # drop 옵션 조정하면 열 추가 안됨
DF2

   name  kor  eng  math
0   마징가   89   70    99
1   태권V  100   80    88
2  원더우먼   99   90    77